In [1]:
import pandas as pd
import numpy as np

In [2]:
pwd()

'C:\\Users\\HP'

In [4]:
df=pd.read_csv("pandas_data.tsv")
df

ParserError: Error tokenizing data. C error: Expected 1 fields in line 6, saw 5

In [4]:
df

                name\tmaths\tphy\tresult
0                      tom\t80\t70\tPass
1                     jhon\t75\t67\tPass
2                      max\t28\t55\tFail
3                      raj\t88\t70\tPass
4                    shyam\t23\t29\tFail
5                      ram\t95\t89\tPass
6         seeta     60      69      pass
7         rina      70      80      pass
8         sheel     90      95      pass
9         mil       30      40      Fail
10        sashi     25      30      Fail
11        ravi      70      60      pass
12        tim       82      67      pass
13      jay       20      34      fail

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
chipo=pd.read_csv("pandas_tdata.tsv", sep='\t')

In [7]:
chipo

                                    name  maths   phy result
0                                    tom   80.0  70.0   Pass
1                                   jhon   75.0  67.0   Pass
2                                    max   28.0  55.0   Fail
3                                    raj   88.0  70.0   Pass
4                                  shyam   23.0  29.0   Fail
5                                    ram   95.0  89.0   Pass
6         seeta     60      69      pass    NaN   NaN    NaN
7         rina      70      80      pass    NaN   NaN    NaN
8         sheel     90      95      pass    NaN   NaN    NaN
9         mil       30      40      Fail    NaN   NaN    NaN
10        sashi     25      30      Fail    NaN   NaN    NaN
11        ravi      70      60      pass    NaN   NaN    NaN
12        tim       82      67      pass    NaN   NaN    NaN
13      jay       20      34      fail      NaN   NaN    NaN

In [8]:
chipo.head(10)

                                 name  maths   phy result
0                                 tom   80.0  70.0   Pass
1                                jhon   75.0  67.0   Pass
2                                 max   28.0  55.0   Fail
3                                 raj   88.0  70.0   Pass
4                               shyam   23.0  29.0   Fail
5                                 ram   95.0  89.0   Pass
6      seeta     60      69      pass    NaN   NaN    NaN
7      rina      70      80      pass    NaN   NaN    NaN
8      sheel     90      95      pass    NaN   NaN    NaN
9      mil       30      40      Fail    NaN   NaN    NaN

In [9]:
chipo.shape

(14, 4)

In [10]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    14 non-null     object
 1   maths   6 non-null      float64
 2   phy     6 non-null      float64
 3   result  6 non-null      object
dtypes: float64(2), object(2)
memory usage: 576.0+ bytes

In [11]:
chipo.isnull()

     name  maths    phy  result
0   False  False  False   False
1   False  False  False   False
2   False  False  False   False
3   False  False  False   False
4   False  False  False   False
5   False  False  False   False
6   False   True   True    True
7   False   True   True    True
8   False   True   True    True
9   False   True   True    True
10  False   True   True    True
11  False   True   True    True
12  False   True   True    True
13  False   True   True    True

In [12]:
chipo=pd.read_csv("pandas_tdata.tsv", sep='\t')
chipo
#shape=chipo.shape

                                    name  maths   phy result
0                                    tom   80.0  70.0   Pass
1                                   jhon   75.0  67.0   Pass
2                                    max   28.0  55.0   Fail
3                                    raj   88.0  70.0   Pass
4                                  shyam   23.0  29.0   Fail
5                                    ram   95.0  89.0   Pass
6         seeta     60      69      pass    NaN   NaN    NaN
7         rina      70      80      pass    NaN   NaN    NaN
8         sheel     90      95      pass    NaN   NaN    NaN
9         mil       30      40      Fail    NaN   NaN    NaN
10        sashi     25      30      Fail    NaN   NaN    NaN
11        ravi      70      60      pass    NaN   NaN    NaN
12        tim       82      67      pass    NaN   NaN    NaN
13      jay       20      34      fail      NaN   NaN    NaN

In [13]:
shape=chipo.shape
shape

(14, 4)

In [14]:
#To find number of columns in Dataframe
print('no of columns:', shape[1])

no of columns: 4

In [15]:
for col in chipo.columns:
    print(col)

name
maths
phy
result

In [16]:
list(chipo.columns)

['name', 'maths', 'phy', 'result']

In [17]:
chipo.index

RangeIndex(start=0, stop=14, step=1)

In [18]:
## QUESTION :HOW DATASET IS INDEXED

In [19]:
import numpy as np
import pandas as pd
from numpy.random import randn as rn

In [20]:
rn(3,3)

array([[ 0.30010563, -0.82697182, -0.30720407],
       [-0.29285245,  0.04110942, -4.20379793],
       [-0.34606816, -0.23246602, -0.01793275]])

In [21]:
np.random.seed(123)
r=rn(3,3)
r

array([[-1.0856306 ,  0.99734545,  0.2829785 ],
       [-1.50629471, -0.57860025,  1.65143654],
       [-2.42667924, -0.42891263,  1.26593626]])

In [22]:
gh=pd.DataFrame(r)
gh

          0         1         2
0 -1.085631  0.997345  0.282978
1 -1.506295 -0.578600  1.651437
2 -2.426679 -0.428913  1.265936

In [23]:
row=['A','B','C']
col=['X','Y','Z']
gh=pd.DataFrame(r,index=row,columns=col)
gh

          X         Y         Z
A -1.085631  0.997345  0.282978
B -1.506295 -0.578600  1.651437
C -2.426679 -0.428913  1.265936

In [24]:
gh.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.997345  0.282978
B -0.578600  1.651437

In [25]:
gh.iloc[[0,2],[1,2]]

          Y         Z
A  0.997345  0.282978
C -0.428913  1.265936

In [26]:
## MOST ORDERDED ITEM

In [42]:
data={'Brand':['lyra','vip','delux','vip','vip','lyra'],'User':['a','b','a','a','b','c'],'sale':[100,200,200,300,400,500]}

In [43]:
zx=pd.DataFrame(data)
zx

   Brand User  sale
0   lyra    a   100
1    vip    b   200
2  delux    a   200
3    vip    a   300
4    vip    b   400
5   lyra    c   500

In [44]:
bybrand=zx.groupby(['Brand','sale'])

In [30]:
bybrand

In [37]:
bybrand=zx.groupby(['sale']).sale.value_counts().to_frame()

In [45]:
bybrand.sum()

           User
Brand sale
delux 200     a
lyra  100     a
      500     c
vip   200     b
      300     a
      400     b

##HOW MANY ITEMS WERE ORDERDEd

In [46]:
bybrand.max()

           User
Brand sale
delux 200     a
lyra  100     a
      500     c
vip   200     b
      300     a
      400     b

In [47]:
bybrand1=zx.groupby(['Brand']).Brand.value_counts().to_frame()

In [48]:
bybrand1.max()

Brand    3
dtype: int64